# Задача на if №3
print('Введите название двух цветов из перечисленных, для смешивания: красный, синий, желтый')
a = input(str())
b = input(str())



if a == 'красный' and b == 'синий':
    print('Фиолетовый')
elif a == 'красный' and b == 'желтый':
    print('Оранжевый')
elif a == 'синий' and b == 'желтый':
    print('Зеленый')
else:
    print('Ошибка, введены неверные данные!')

# как при получении ошибки вернуть программу повторно к первой строке, с просьбой ввести названия цветов?