
#Задачи на if
#№ 1
#a, b, c = 10, 12, 10
print('Введите длину сторон треугольника:')
a, b, c = int(input()), int(input()), int(input()) # решил попробовать записать переменные используя "input"
# в строчку, чтобы проверить, будет ли программа так работать.
# Вопрос: лучше все же как во второй задаче в столбик писать или разницы нет?

if a == b and b == c:
    print('Равносторонний')
elif a == b and b != c or a != b and b == c or a == c and c != b:
    print('Равнобедренный')
elif a != b and b != c and c != a:
    print('Разносторонний')





